{
  "services": [
    {
      "name": "Azure security documentation",
      "description": "Azure offers security advantages that support compliance efforts, and provide cost-effective security for your organization, and help protect your hybrid and multicloud platforms, applications, and data.",
      "url": "https://learn.microsoft.com/en-us/azure/security/",
      "category": "Security"
    },
    {
      "name": "Microsoft Cloud Adoption Framework for Azure",
      "description": "Secure methodology designed to help cloud architects and business decision makers create and implement security strategies for the cloud",
      "url": "https://learn.microsoft.com/en-us/azure/security/",
      "category": "Security"
    },
    {
      "name": "Azure security fundamentals",
      "description": "Learn how to secure your cloud solutions on Azure",
      "url": "https://learn.microsoft.com/en-us/azure/security/",
      "category": "Security"
    },
    {
      "name": "Azure Security Benchmark",
      "description": "Best practices and recommendations to secure your cloud deployments",
      "url": "https://learn.microsoft.com/en-us/azure/security/",
      "category": "Security"
    },
    {
      "name": "Azure Well-Architected Framework",
      "description": "Design principles for a securely architected system hosted on cloud or on-premises datacenters",
      "url": "https://learn.microsoft.com/en-us/azure/security/",
      "category": "Other"
    },
    {
      "name": "Azure Architecture Center",
      "description": "A set of guiding tenets that can be used to protect your applications and data from threats",
      "url": "https://learn.microsoft.com/en-us/azure/security/",
      "category": "Other"
    },
    {
      "name": "Azure key management",
      "description": "Key management solutions in Azure",
      "url": "https://learn.microsoft.com/en-us/azure/security/",
      "category": "Other"
    },
    {
      "name": "Azure Backup",
      "description": "Azure Backup provides security to your backup environment, both when your data is in transit and at rest. With Azure Backup, you can back up:",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/backup-plan-to-protect-against-ransomware",
      "category": "Security"
    },
    {
      "name": "Azure network security documentation",
      "description": "Learn about the various Azure network security services available that provide security for your resources in Azure.",
      "url": "https://learn.microsoft.com/en-us/azure/networking/security/",
      "category": "Networking"
    },
    {
      "name": "Introduction to Azure security",
      "description": "We know that security is job one in the cloud and how important it is that you find accurate and timely information about Azure security. One of the best reasons to use Azure for your applications and services is to take advantage of its wide array of security tools and capabilities. These tools and capabilities help make it possible to create secure solutions on the secure Azure platform. Microsoft Azure provides confidentiality, integrity, and availability of customer data, while also enabling transparent accountability.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "Security"
    },
    {
      "name": "Azure platform",
      "description": "Azure is a public cloud service platform that supports a broad selection of operating systems, programming languages, frameworks, tools, databases, and devices. It can run Linux containers with Docker integration; build apps with JavaScript, Python, .NET, PHP, Java, and Node.js; build back-ends for iOS, Android, and Windows devices.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "Compute"
    },
    {
      "name": "Summary of Azure security capabilities",
      "description": "Depending on the cloud service model, there's variable responsibility for who is responsible for managing the security of the application or service. There are capabilities available in the Azure Platform to assist you in meeting these responsibilities through built-in features, and through partner solutions that can be deployed into an Azure subscription.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "Security"
    },
    {
      "name": "Azure Resource Manager",
      "description": "Azure Resource Manager enables you to work with the resources in your solution as a group. You can deploy, update, or delete all the resources for your solution in a single, coordinated operation. You use an Azure Resource Manager template for deployment and that template can work for different environments such as testing, staging, and production. Resource Manager provides security, auditing, and tagging features to help you manage your resources after deployment.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "Security"
    },
    {
      "name": "Azure Monitor",
      "description": "Azure Monitor offers visualization, query, routing, alerting, auto scale, and automation on data both from the Azure subscription (Activity Log) and each individual Azure resource (Resource Logs). You can use Azure Monitor to alert you on security-related events that are generated in Azure logs.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "Security"
    },
    {
      "name": "Azure Monitor logs",
      "description": "Azure Monitor logs â\u0080\u0093 Provides an IT management solution for both on-premises and non-Microsoft cloud-based infrastructure (such as Amazon Web Services) in addition to Azure resources. Data from Azure Monitor can be routed directly to Azure Monitor logs so you can see metrics and logs for your entire environment in one place.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "Other"
    },
    {
      "name": "Azure Advisor",
      "description": "Azure Advisor is a personalized cloud consultant that helps you to optimize your Azure deployments. It analyzes your resource configuration and usage data. It then recommends solutions to help improve the performance, security, and reliability of your resources while looking for opportunities to reduce your overall Azure spend. Azure Advisor provides security recommendations, which can significantly improve your overall security posture for solutions you deploy in Azure. These recommendations are drawn from security analysis performed by Microsoft Defender for Cloud.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "Security"
    },
    {
      "name": "Authentication and authorization in Azure App Service",
      "description": "App Service Authentication / Authorization is a feature that provides a way for your application to sign in users so that you don't have to change code on the app backend. It provides an easy way to protect your application and work with per-user data.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "Other"
    },
    {
      "name": "Azure role-based access control (Azure RBAC)",
      "description": "You can secure your storage account with Azure role-based access control (Azure RBAC). Restricting access based on the need to know and least privilege security principles is imperative for organizations that want to enforce Security policies for data access. These access rights are granted by assigning the appropriate Azure role to groups and applications at a certain scope. You can use Azure built-in roles, such as Storage Account Contributor, to assign privileges to users. Access to the storage keys for a storage account using the Azure Resource Manager model can be controlled through Azure RBAC.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "Storage"
    },
    {
      "name": "Azure Virtual Network",
      "description": "An Azure virtual network (VNet) is a representation of your own network in the cloud. It's a logical isolation of the Azure network fabric dedicated to your subscription. You can fully control the IP address blocks, DNS settings, security policies, and route tables within this network. You can segment your VNet into subnets and place Azure IaaS virtual machines (VMs) and/or Cloud services (PaaS role instances) on Azure Virtual Networks.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "Compute"
    },
    {
      "name": "Azure Virtual Network Manager",
      "description": "Azure Virtual Network Manager  provides a centralized solution for protecting your virtual networks at scale. It uses security admin rules to centrally define and enforce security policies for your virtual networks across your entire organization. Security admin rules take precedence over network security group(NSGs) rules and are applied on the virtual network. This allows organizations to enforce core policies with security admin rules, while still enabling downstream teams to tailor NSGs according to their specific needs at the subnet and NIC levels. Depending on the needs of your organization you can use Allow, Deny, or Always Allow rule actions to enforce security policies.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "Networking"
    },
    {
      "name": "Azure Private Link",
      "description": "Azure Private Link enables you to access Azure PaaS Services (for example, Azure Storage and SQL Database) and Azure hosted customer-owned/partner services privately in your virtual network over a private endpoint. Setup and consumption using Azure Private Link is consistent across Azure PaaS, customer-owned, and shared partner services. Traffic from your virtual network to the Azure service always remains on the Microsoft Azure backbone network.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "Storage"
    },
    {
      "name": "Azure Load Balancer",
      "description": "Azure Load Balancer delivers high availability and network performance to your applications. It's a Layer 4 (TCP, UDP) load balancer that distributes incoming traffic among healthy instances of services defined in a load-balanced set. Azure Load Balancer can be configured to:",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "Networking"
    },
    {
      "name": "Azure DNS",
      "description": "The Domain Name System, or DNS, is responsible for translating (or resolving) a website or service name to its IP address. Azure DNS is a hosting service for DNS domains, providing name resolution using Microsoft Azure infrastructure. By hosting your domains in Azure, you can manage your DNS records using the same credentials, APIs, tools, and billing as your other Azure services. DNS supports the availability aspect of the â\u0080\u009cCIAâ\u0080\u009d security triad.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "Networking"
    },
    {
      "name": "Azure Monitor logs NSGs",
      "description": "You can enable the following diagnostic log categories for NSGs:",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "Other"
    },
    {
      "name": "Azure confidential computing",
      "description": "Azure confidential computing provides the final, missing piece, of the data protection puzzle. It allows you to keep your data encrypted always. While at rest, when in motion through the network, and now, even while loaded in memory and in use. Additionally, by making Remote Attestation possible, it allows you to cryptographically verify that the VM you deploy booted securely and is configured correctly, before unlocking your data.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "Compute"
    },
    {
      "name": "Azure Site Recovery",
      "description": "An important part of your organization's business continuity/disaster recovery (BCDR) strategy is figuring out how to keep corporate workloads and apps up and running when planned and unplanned outages occur. Azure Site Recovery helps orchestrate replication, failover, and recovery of workloads and apps so that they're available from a secondary location if your primary location goes down.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "Other"
    },
    {
      "name": "Ransomware protection in Azure",
      "description": "Ransomware and extortion are a high profit, low-cost business, which has a debilitating impact on targeted organizations, national/regional security, economic security, and public health and safety. What started as simple, single-PC ransomware grew to include various extortion techniques directed at all types of corporate networks and cloud platforms.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/ransomware-protection",
      "category": "Networking"
    },
    {
      "name": "What is Azure Policy?",
      "description": "This overview describes how Azure Policy helps to enforce organizational standards and to assess compliance at-scale. Through its compliance dashboard, it provides an aggregated view to evaluate the overall state of the environment, with the ability to drill down to the per-resource, per-policy granularity. It also helps to bring your resources to compliance through bulk remediation for existing resources and automatic remediation for new resources.",
      "url": "https://learn.microsoft.com/en-us/azure/governance/policy/overview",
      "category": "Other"
    },
    {
      "name": "Azure Policy and Azure RBAC",
      "description": "There are a few key differences between Azure Policy and Azure role-based access control (Azure RBAC). Azure Policy evaluates state by examining properties on resources that are represented in Resource Manager and properties of some Resource Providers. Azure Policy ensures that resource state is compliant to your business rules without concern for who made the change or who has permission to make a change. Azure Policy through DenyAction effect can also block certain actions on resources. Some Azure Policy resources, such as policy definitions, initiative definitions, and assignments, are visible to all users. This design enables transparency to all users and services for what policy rules are set in their environment.",
      "url": "https://learn.microsoft.com/en-us/azure/governance/policy/overview",
      "category": "Other"
    },
    {
      "name": "Azure RBAC permissions in Azure Policy",
      "description": "Azure Policy has several permissions, known as operations, in two Resource Providers:",
      "url": "https://learn.microsoft.com/en-us/azure/governance/policy/overview",
      "category": "Other"
    },
    {
      "name": "Special permissions requirement for Azure Policy with Azure Virtual Network Manager",
      "description": "Azure Virtual Network Manager (preview) enables you to apply consistent management and security policies to multiple Azure virtual networks throughout your cloud infrastructure. Azure Virtual Network Manager (AVNM) dynamic groups use Azure Policy definitions to evaluate virtual network membership in those groups.",
      "url": "https://learn.microsoft.com/en-us/azure/governance/policy/overview",
      "category": "Networking"
    },
    {
      "name": "Resources covered by Azure Policy",
      "description": "Although a policy can be assigned at the management group level, only resources at the subscription or resource group level are evaluated.",
      "url": "https://learn.microsoft.com/en-us/azure/governance/policy/overview",
      "category": "Other"
    },
    {
      "name": "Azure Policy objects",
      "description": "The objects include policy definitions, initiative definitions, and assignments.",
      "url": "https://learn.microsoft.com/en-us/azure/governance/policy/overview",
      "category": "Other"
    },
    {
      "name": "Maximum count of Azure Policy objects",
      "description": "There's a maximum count for each object type for Azure Policy. For definitions, an entry of Scope means the management group or subscription. For assignments and exemptions, an entry of Scope means the management group, subscription, resource group, or individual resource.",
      "url": "https://learn.microsoft.com/en-us/azure/governance/policy/overview",
      "category": "Other"
    },
    {
      "name": "What is an Azure landing zone?",
      "description": "An Azure landing zone is an environment that follows key design principles across eight design areas. These design principles accommodate all application portfolios and enable application migration, modernization, and innovation at scale. An Azure landing zone uses subscriptions to isolate and scale application resources and platform resources. Subscriptions for application resources are called application landing zones, and subscriptions for platform resources are called platform landing zones.",
      "url": "https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/ready/landing-zone/",
      "category": "Other"
    },
    {
      "name": "Azure landing zone architecture",
      "description": "An Azure landing zone architecture is scalable and modular to meet various deployment needs. The repeatable infrastructure allows you to apply configurations and controls to every subscription consistently. Modules make it easy to deploy and modify specific Azure landing zone architecture components as your requirements evolve.",
      "url": "https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/ready/landing-zone/",
      "category": "Other"
    },
    {
      "name": "Azure Verified Modules for Platform Landing Zones",
      "description": "For infrastructure as code (IaC) deployments, you can use Azure Verified Modules for Platform Landing Zones. Available for both Bicep and Terraform, these modules provide a set of reusable, customizable, and extensible modules that help you deploy a platform landing zone. The modules are designed to help you accelerate the delivery of the recommended resource hierarchy and governance model. You can integrate shared services, network connectivity, and application workloads into your deployment or manage them independently.",
      "url": "https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/ready/landing-zone/",
      "category": "Networking"
    },
    {
      "name": "Azure Platform Landing Zones Portal Accelerator",
      "description": "This accelerator is a ready-made deployment experience. The Azure landing zone portal accelerator deploys the conceptual architecture (see figure 1) and applies predetermined configurations to key components such as management groups and policies. It suits organizations whose conceptual architecture aligns with the planned operating model and resource structure.",
      "url": "https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/ready/landing-zone/",
      "category": "Other"
    },
    {
      "name": "Azure cloud management checklist",
      "description": "Effective cloud management ensures your Azure cloud estate aligns with business objectives and minimizes the effects of incidents. The Cloud Adoption Framework's (CAF) Manage methodology outlines the RAMP (Ready, Administer, Monitor, Protect) process and provides clear steps for managing your Azure cloud estate.",
      "url": "https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/manage/",
      "category": "Other"
    },
    {
      "name": "Introduction to security on Azure",
      "description": "If you're new to security on Azure, the best way to learn more is with Microsoft Learn training. This free online platform provides interactive training for Microsoft products and more.",
      "url": "https://learn.microsoft.com/en-us/azure/architecture/guide/security/security-start-here",
      "category": "Security"
    }
  ],
  "security_practices": [
    {
      "title": "",
      "description": "Upgrade to Microsoft Edge to take advantage of the latest features, security updates, and technical support.",
      "url": "https://learn.microsoft.com/en-us/azure/security/",
      "category": "General Security"
    },
    {
      "title": "Azure security documentation",
      "description": "Azure offers security advantages that support compliance efforts, and provide cost-effective security for your organization, and help protect your hybrid and multicloud platforms, applications, and data.",
      "url": "https://learn.microsoft.com/en-us/azure/security/",
      "category": "Compliance"
    },
    {
      "title": "Implementation and operation",
      "description": "Migrate and modernize security operations management",
      "url": "https://learn.microsoft.com/en-us/azure/security/",
      "category": "General Security"
    },
    {
      "title": "Continued learning",
      "description": "Discover learning paths that help you improve your security in the cloud",
      "url": "https://learn.microsoft.com/en-us/azure/security/",
      "category": "General Security"
    },
    {
      "title": "Microsoft Learn training",
      "description": "If you're new to security, build your skills with Microsoft Learn training",
      "url": "https://learn.microsoft.com/en-us/azure/security/",
      "category": "General Security"
    },
    {
      "title": "Microsoft Cloud Adoption Framework for Azure",
      "description": "Secure methodology designed to help cloud architects and business decision makers create and implement security strategies for the cloud",
      "url": "https://learn.microsoft.com/en-us/azure/security/",
      "category": "Monitoring"
    },
    {
      "title": "Azure Architecture Center",
      "description": "A set of guiding tenets that can be used to protect your applications and data from threats",
      "url": "https://learn.microsoft.com/en-us/azure/security/",
      "category": "General Security"
    },
    {
      "title": "Microsoft Sentinel",
      "description": "See and stop threats before they cause harm",
      "url": "https://learn.microsoft.com/en-us/azure/security/",
      "category": "General Security"
    },
    {
      "title": "Microsoft Defender for Cloud",
      "description": "Unify security management and advanced threat protection across hybrid cloud workloads",
      "url": "https://learn.microsoft.com/en-us/azure/security/",
      "category": "General Security"
    },
    {
      "title": "Microsoft Defender for Identity",
      "description": "Improve security of hybrid environments from cyber attacks and insider threats",
      "url": "https://learn.microsoft.com/en-us/azure/security/",
      "category": "General Security"
    },
    {
      "title": "Microsoft Defender for Cloud Apps",
      "description": "Cloud Access Security Broker (CASB) that operates on multiple clouds",
      "url": "https://learn.microsoft.com/en-us/azure/security/",
      "category": "General Security"
    },
    {
      "title": "Microsoft Defender for IoT",
      "description": "Threat detection for IoT/OT environments",
      "url": "https://learn.microsoft.com/en-us/azure/security/",
      "category": "General Security"
    },
    {
      "title": "Microsoft Defender XDR",
      "description": "Security solutions that protect your enterprise across attack surfaces",
      "url": "https://learn.microsoft.com/en-us/azure/security/",
      "category": "General Security"
    },
    {
      "title": "",
      "description": "Upgrade to Microsoft Edge to take advantage of the latest features, security updates, and technical support.",
      "url": "https://learn.microsoft.com/en-us/azure/security-center/",
      "category": "General Security"
    },
    {
      "title": "Microsoft Defender for Cloud documentation",
      "description": "Microsoft Defender for Cloud provides unified security management and advanced threat protection across hybrid cloud workloads.",
      "url": "https://learn.microsoft.com/en-us/azure/security-center/",
      "category": "General Security"
    },
    {
      "title": "",
      "description": "Upgrade to Microsoft Edge to take advantage of the latest features, security updates, and technical support.",
      "url": "https://learn.microsoft.com/en-us/azure/sentinel/",
      "category": "General Security"
    },
    {
      "title": "Microsoft Sentinel documentation",
      "description": "Microsoft Sentinel provides attack detection, threat visibility, proactive hunting, and threat response to help you stop threats before they cause harm.",
      "url": "https://learn.microsoft.com/en-us/azure/sentinel/",
      "category": "General Security"
    },
    {
      "title": "",
      "description": "Upgrade to Microsoft Edge to take advantage of the latest features, security updates, and technical support.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/zero-trust",
      "category": "General Security"
    },
    {
      "title": "In this article",
      "description": "Zero Trust is a new security model that assumes breach and verifies each request as though it originated from an uncontrolled network. In this article, you'll learn about the guiding principles of Zero Trust and find resources to help you implement Zero Trust.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/zero-trust",
      "category": "Network Security"
    },
    {
      "title": "Guiding principles of Zero Trust",
      "description": "Today, organizations need a new security model that effectively adapts to the complexity of the modern environment, embraces the mobile workforce, and protects people, devices, applications, and data wherever they are located.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/zero-trust",
      "category": "General Security"
    },
    {
      "title": "Guiding principles of Zero Trust",
      "description": "To address this new world of computing, Microsoft highly recommends the Zero Trust security model, which is based on these guiding principles:",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/zero-trust",
      "category": "General Security"
    },
    {
      "title": "Zero Trust architecture",
      "description": "A Zero Trust approach extends throughout the entire digital estate and serves as an integrated security philosophy and end-to-end strategy.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/zero-trust",
      "category": "General Security"
    },
    {
      "title": "Zero Trust architecture",
      "description": "As an alternative to deployment guidance that provides configuration steps for each of the technology components protected by Zero Trust principles, Rapid Modernization Plan (RaMP) guidance is based on initiatives and gives you a set of deployment paths to more quickly implement key layers of protection.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/zero-trust",
      "category": "Monitoring"
    },
    {
      "title": "From security perimeter to Zero Trust",
      "description": "Zero trust principles help establish and continuously improve security assurances, while maintaining flexibility to keep pace with this new world. Most zero trust journeys start with access control and focus on identity as a preferred and primary control while they continue to embrace network security technology as a key element. Network technology and the security perimeter tactic are still present in a modern access control model, but they aren't the dominant and preferred approach in a complete access control strategy.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/zero-trust",
      "category": "Authentication"
    },
    {
      "title": "Develop apps using Zero Trust principles",
      "description": "Zero Trust is a security framework that does not rely on the implicit trust afforded to interactions behind a secure network perimeter. Instead, it uses the principles of explicit verification, least privileged access, and assuming breach to keep users and data secure while allowing for common scenarios like access to applications from outside the network perimeter.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/zero-trust",
      "category": "Network Security"
    },
    {
      "title": "Develop apps using Zero Trust principles",
      "description": "As a developer, it is essential that you use Zero Trust principles to keep users safe and data secure. App developers can improve app security, minimize the impact of breaches, and ensure that their applications meet their customers' security requirements by adopting Zero Trust principles.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/zero-trust",
      "category": "General Security"
    },
    {
      "title": "Zero Trust and Microsoft 365",
      "description": "Microsoft 365 is built with many security and information protection capabilities to help you build Zero Trust into your environment. Many of the capabilities can be extended to protect access to other SaaS apps your organization uses and the data within these apps. See deploying Zero Trust for Microsoft 365 to learn more.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/zero-trust",
      "category": "General Security"
    },
    {
      "title": "",
      "description": "Upgrade to Microsoft Edge to take advantage of the latest features, security updates, and technical support.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/backup-plan-to-protect-against-ransomware",
      "category": "General Security"
    },
    {
      "title": "In this article",
      "description": "Ransomware attacks deliberately encrypt or erase data and systems to force your organization to pay money to attackers. These attacks target your data, your backups, and also key documentation required for you to recover without paying the attackers (as a means to increase the chances your organization will pay).",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/backup-plan-to-protect-against-ransomware",
      "category": "General Security"
    },
    {
      "title": "In this article",
      "description": "This article addresses what to do before an attack to protect your critical business systems and during an attack to ensure a rapid recovery of business operations.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/backup-plan-to-protect-against-ransomware",
      "category": "General Security"
    },
    {
      "title": "What is ransomware?",
      "description": "Ransomware is a type of extortion attack that encrypts files and folders, preventing access to important data and systems. Attackers use ransomware to extort money from victims by demanding money, usually in the form of cryptocurrencies, in exchange for a decryption key or in exchange for not releasing sensitive data to the dark web or the public internet.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/backup-plan-to-protect-against-ransomware",
      "category": "Data Protection"
    },
    {
      "title": "What is ransomware?",
      "description": "While early ransomware mostly used malware that spread with phishing or between devices, human-operated ransomware has emerged where a gang of active attackers, driven by human attack operators, target all systems in an organization (rather than a single device or set of devices). An attack can:",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/backup-plan-to-protect-against-ransomware",
      "category": "General Security"
    },
    {
      "title": "What is ransomware?",
      "description": "The ransomware leverages the attackersâ\u0080\u0099 knowledge of common system and security misconfigurations and vulnerabilities to infiltrate the organization, navigate the enterprise network, and adapt to the environment and its weaknesses as they go.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/backup-plan-to-protect-against-ransomware",
      "category": "Network Security"
    },
    {
      "title": "What is ransomware?",
      "description": "The real damage is often done when the attack exfiltrates files while leaving backdoors in the network for future malicious activityâ\u0080\u0094and these risks persist whether or not the ransom is paid. These attacks can be catastrophic to business operations and difficult to clean up, requiring complete adversary eviction to protect against future attacks. Unlike early forms of ransomware that only required malware remediation, human-operated ransomware can continue to threaten your business operations after the initial encounter.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/backup-plan-to-protect-against-ransomware",
      "category": "Network Security"
    },
    {
      "title": "Impact of an attack",
      "description": "The impact of a ransomware attack on any organization is difficult to quantify accurately. Depending on the scope of the attack, the impact could include:",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/backup-plan-to-protect-against-ransomware",
      "category": "General Security"
    },
    {
      "title": "How can you protect yourself?",
      "description": "The best way to prevent falling victim to ransomware is to implement preventive measures and have tools that protect your organization from every step that attackers take to infiltrate your systems.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/backup-plan-to-protect-against-ransomware",
      "category": "General Security"
    },
    {
      "title": "How can you protect yourself?",
      "description": "You can reduce your on-premises exposure by moving your organization to a cloud service. Microsoft has invested in native security capabilities that make Microsoft Azure resilient against ransomware attacks and helps organizations defeat ransomware attack techniques. For a comprehensive view of ransomware and extortion and how to protect your organization, use the information in the Human-Operated Ransomware Mitigation Project Plan PowerPoint presentation.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/backup-plan-to-protect-against-ransomware",
      "category": "General Security"
    },
    {
      "title": "How can you protect yourself?",
      "description": "You should assume that at some point in time you'll fall victim to a ransomware attack. One of the most important steps you can take to protect your data and avoid paying a ransom is to have a reliable backup and restore plan for your business-critical information. Since ransomware attackers have invested heavily into neutralizing backup applications and operating system features like volume shadow copy, it's critical to have backups that are inaccessible to a malicious attacker.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/backup-plan-to-protect-against-ransomware",
      "category": "General Security"
    },
    {
      "title": "Azure Backup",
      "description": "Azure Backup provides security to your backup environment, both when your data is in transit and at rest. With Azure Backup, you can back up:",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/backup-plan-to-protect-against-ransomware",
      "category": "General Security"
    },
    {
      "title": "Azure Backup",
      "description": "The backup data is stored in Azure storage and the guest or attacker has no direct access to backup storage or its contents. With virtual machine backup, the backup snapshot creation and storage is done by Azure fabric where the guest or attacker has no involvement other than quiescing the workload for application consistent backups. With SQL and SAP HANA, the backup extension gets temporary access to write to specific blobs. In this way, even in a compromised environment, existing backups can't be tampered with or deleted by the attacker.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/backup-plan-to-protect-against-ransomware",
      "category": "General Security"
    },
    {
      "title": "Azure Backup",
      "description": "Checks have been added to make sure only valid users can perform various operations. These include adding an extra layer of authentication. As part of adding an extra layer of authentication for critical operations, you're prompted to enter a security PIN before modifying online backups.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/backup-plan-to-protect-against-ransomware",
      "category": "Authentication"
    },
    {
      "title": "Azure Backup",
      "description": "Learn more about the security features built into Azure Backup.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/backup-plan-to-protect-against-ransomware",
      "category": "General Security"
    },
    {
      "title": "What to do before an attack",
      "description": "As mentioned earlier, you should assume that at some point in time you'll fall victim to a ransomware attack. Identifying your business-critical systems and applying best practices before an attack will get you back up and running as quickly as possible.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/backup-plan-to-protect-against-ransomware",
      "category": "General Security"
    },
    {
      "title": "Determine what is most important to you",
      "description": "Ransomware can attack while you're planning for an attack so your first priority should be to identify the business-critical systems that are most important to you and begin performing regular backups on those systems.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/backup-plan-to-protect-against-ransomware",
      "category": "General Security"
    },
    {
      "title": "Steps to take before an attack",
      "description": "Apply these best practices before an attack.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/backup-plan-to-protect-against-ransomware",
      "category": "General Security"
    },
    {
      "title": "What to do during an attack",
      "description": "If you're attacked, your prioritized back up list becomes your prioritized restore list. Before you restore, validate again that your backup is good. You may be able to look for malware inside the backup.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/backup-plan-to-protect-against-ransomware",
      "category": "General Security"
    },
    {
      "title": "Steps to take during an attack",
      "description": "Apply these best practices during an attack.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/backup-plan-to-protect-against-ransomware",
      "category": "General Security"
    },
    {
      "title": "Post attack or simulation",
      "description": "After a ransomware attack or an incident response simulation, take the following steps to improve your backup and restore plans as well as your security posture:",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/backup-plan-to-protect-against-ransomware",
      "category": "General Security"
    },
    {
      "title": "Next steps",
      "description": "For best practices on deploying ransomware protection, see Rapidly protect against ransomware and extortion.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/backup-plan-to-protect-against-ransomware",
      "category": "General Security"
    },
    {
      "title": "Next steps",
      "description": "Help protect from ransomware with Microsoft Azure Backup (26-minute video)",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/backup-plan-to-protect-against-ransomware",
      "category": "General Security"
    },
    {
      "title": "Next steps",
      "description": "Advanced multistage attack detection in Microsoft Sentinel",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/backup-plan-to-protect-against-ransomware",
      "category": "General Security"
    },
    {
      "title": "",
      "description": "Upgrade to Microsoft Edge to take advantage of the latest features, security updates, and technical support.",
      "url": "https://learn.microsoft.com/en-us/azure/sentinel/mitre-coverage",
      "category": "General Security"
    },
    {
      "title": "In this article",
      "description": "MITRE ATT&CK is a publicly accessible knowledge base of tactics and techniques that are commonly used by attackers, and is created and maintained by observing real-world observations. Many organizations use the MITRE ATT&CK knowledge base to develop specific threat models and methodologies that are used to verify security status in their environments.",
      "url": "https://learn.microsoft.com/en-us/azure/sentinel/mitre-coverage",
      "category": "Monitoring"
    },
    {
      "title": "In this article",
      "description": "Microsoft Sentinel analyzes ingested data, not only to detect threats and help you investigate, but also to visualize the nature and coverage of your organization's security status.",
      "url": "https://learn.microsoft.com/en-us/azure/sentinel/mitre-coverage",
      "category": "General Security"
    },
    {
      "title": "In this article",
      "description": "This article describes how to use the MITRE page in Microsoft Sentinel to view the analytics rules (detections) already active in your workspace, and the detections available for you to configure, to understand your organization's security coverage, based on the tactics and techniques from the MITRE ATT&CKÂ® framework.",
      "url": "https://learn.microsoft.com/en-us/azure/sentinel/mitre-coverage",
      "category": "General Security"
    },
    {
      "title": "View current MITRE coverage",
      "description": "In the Defender portal, select Microsoft Sentinel > Threat management > MITRE ATT&CK.",
      "url": "https://learn.microsoft.com/en-us/azure/sentinel/mitre-coverage",
      "category": "General Security"
    },
    {
      "title": "View current MITRE coverage",
      "description": "To filter the page by a specific threat scenario, toggle the View MITRE by threat scenario option on, and then select a threat scenario from the drop-down menu. The page is updated accordingly. For example:",
      "url": "https://learn.microsoft.com/en-us/azure/sentinel/mitre-coverage",
      "category": "General Security"
    },
    {
      "title": "View current MITRE coverage",
      "description": "In the Azure portal, under Threat management, select MITRE ATT&CK (Preview).",
      "url": "https://learn.microsoft.com/en-us/azure/sentinel/mitre-coverage",
      "category": "General Security"
    },
    {
      "title": "View current MITRE coverage",
      "description": "Use the search bar to search for a specific technique in the matrix, using the technique name or ID, to view your organization's security status for the selected technique.",
      "url": "https://learn.microsoft.com/en-us/azure/sentinel/mitre-coverage",
      "category": "General Security"
    },
    {
      "title": "View current MITRE coverage",
      "description": "On the Defender portal, the details pane also shows recommended coverage details, including the ratio of active detections and security services (products) out of all recommended detections and services for the selected technique.",
      "url": "https://learn.microsoft.com/en-us/azure/sentinel/mitre-coverage",
      "category": "General Security"
    },
    {
      "title": "Simulate possible coverage with available detections",
      "description": "In the MITRE coverage matrix, simulated coverage refers to detections that are available, but not currently configured in your Microsoft Sentinel workspace. View your simulated coverage to understand your organization's possible security status, were you to configure all detections available to you.",
      "url": "https://learn.microsoft.com/en-us/azure/sentinel/mitre-coverage",
      "category": "General Security"
    },
    {
      "title": "Simulate possible coverage with available detections",
      "description": "In Microsoft Sentinel, under Threat management, select MITRE ATTA&CK (Preview), and then select items in the Simulated rules menu to simulate your organization's possible security status.",
      "url": "https://learn.microsoft.com/en-us/azure/sentinel/mitre-coverage",
      "category": "General Security"
    },
    {
      "title": "Use the MITRE ATT&CK framework in analytics rules and incidents",
      "description": "Having a scheduled rule with MITRE techniques applied running regularly in your Microsoft Sentinel workspace enhances the security status shown for your organization in the MITRE coverage matrix.",
      "url": "https://learn.microsoft.com/en-us/azure/sentinel/mitre-coverage",
      "category": "General Security"
    },
    {
      "title": "Use the MITRE ATT&CK framework in analytics rules and incidents",
      "description": "For more information, see Detect threats out-of-the-box and Create custom analytics rules to detect threats.",
      "url": "https://learn.microsoft.com/en-us/azure/sentinel/mitre-coverage",
      "category": "General Security"
    },
    {
      "title": "Use the MITRE ATT&CK framework in analytics rules and incidents",
      "description": "For more information, see Hunt for threats with Microsoft Sentinel and Keep track of data during hunting with Microsoft Sentinel.",
      "url": "https://learn.microsoft.com/en-us/azure/sentinel/mitre-coverage",
      "category": "General Security"
    },
    {
      "title": "",
      "description": "Upgrade to Microsoft Edge to take advantage of the latest features, security updates, and technical support.",
      "url": "https://learn.microsoft.com/en-us/azure/sentinel/summary-rules",
      "category": "General Security"
    },
    {
      "title": "In this article",
      "description": "Use summary rules in Microsoft Sentinel to aggregate large sets of data in the background for a smoother security operations experience across all log tiers. Summary data is precompiled in custom log tables and provide fast query performance, including queries run on data derived from low-cost log tiers. Summary rules can help optimize your data for:",
      "url": "https://learn.microsoft.com/en-us/azure/sentinel/summary-rules",
      "category": "Monitoring"
    },
    {
      "title": "Quickly find a malicious IP address in your network traffic",
      "description": "Scenario: You're a threat hunter, and one of your team's goals is to identify all instances of when a malicious IP address interacted in the network traffic logs from an active incident, in the last 90 days.",
      "url": "https://learn.microsoft.com/en-us/azure/sentinel/summary-rules",
      "category": "Network Security"
    },
    {
      "title": "Quickly find a malicious IP address in your network traffic",
      "description": "Run a subsequent search or correlation with other data to complete the attack story.",
      "url": "https://learn.microsoft.com/en-us/azure/sentinel/summary-rules",
      "category": "General Security"
    },
    {
      "title": "Generate alerts on threat intelligence matches against network data",
      "description": "Generate alerts on threat intelligence matches against noisy, high volume, and low-security value network data.",
      "url": "https://learn.microsoft.com/en-us/azure/sentinel/summary-rules",
      "category": "Network Security"
    },
    {
      "title": "Generate alerts on threat intelligence matches against network data",
      "description": "Scenario: You need to build an analytics rule for firewall logs to match domain names in the system that have been visited against a threat intelligence domain name list.",
      "url": "https://learn.microsoft.com/en-us/azure/sentinel/summary-rules",
      "category": "Network Security"
    },
    {
      "title": "Generate alerts on threat intelligence matches against network data",
      "description": "Most of the data sources are raw logs that are noisy and have high volume, but have lower security value, including IP addresses, Azure Firewall traffic, Fortigate traffic, and so on. There's a total volume of about 1 TB per day.",
      "url": "https://learn.microsoft.com/en-us/azure/sentinel/summary-rules",
      "category": "Network Security"
    },
    {
      "title": "Generate alerts on threat intelligence matches against network data",
      "description": "Extend your query to extract key fields, such as the source address, destination address, and destination port from the CommonSecurityLog_CL table, which is the CommonSecurityLog with the Auxiliary plan.",
      "url": "https://learn.microsoft.com/en-us/azure/sentinel/summary-rules",
      "category": "Monitoring"
    },
    {
      "title": "Generate alerts on threat intelligence matches against network data",
      "description": "Perform an inner lookup against the active Threat Intelligence Indicators to identify any matches with our source address. This allows you to cross-reference your data with known threats.",
      "url": "https://learn.microsoft.com/en-us/azure/sentinel/summary-rules",
      "category": "General Security"
    },
    {
      "title": "Generate alerts on threat intelligence matches against network data",
      "description": "Creating an analytics rule in Microsoft Sentinel that alerts based on results from the MaliciousIPDetection table. This step is crucial for proactive threat detection and incident response.",
      "url": "https://learn.microsoft.com/en-us/azure/sentinel/summary-rules",
      "category": "Monitoring"
    },
    {
      "title": "",
      "description": "Upgrade to Microsoft Edge to take advantage of the latest features, security updates, and technical support.",
      "url": "https://learn.microsoft.com/en-us/azure/sentinel/soc-optimization/soc-optimization-access",
      "category": "General Security"
    },
    {
      "title": "In this article",
      "description": "Security operations center (SOC) teams look for ways to improve processes and outcomes and ensure you have the data needed to address risks without extra ingestion costs. SOC teams want to make sure that you have all the necessary data to act against risks, without paying for more data than needed. At the same time, SOC teams must also adjust security controls as threats and business priorities change, doing so quickly and efficiently to maximize your return on investment.",
      "url": "https://learn.microsoft.com/en-us/azure/sentinel/soc-optimization/soc-optimization-access",
      "category": "General Security"
    },
    {
      "title": "In this article",
      "description": "SOC optimizations are actionable recommendations that surface ways that you can optimize your security controls, gaining more value from Microsoft security services as time goes on.  Recommendations help you reduce costs without affecting SOC needs or coverage, and can help you add security controls and data where needed. These optimizations are tailored to your environment and based on your current coverage and threat landscape.",
      "url": "https://learn.microsoft.com/en-us/azure/sentinel/soc-optimization/soc-optimization-access",
      "category": "General Security"
    },
    {
      "title": "In this article",
      "description": "Use SOC optimization recommendations to help you close coverage gaps against specific threats and tighten your ingestion rates against data that doesn't provide security value. SOC optimizations help you optimize your Microsoft Sentinel workspace, without having your SOC teams spend time on manual analysis and research.",
      "url": "https://learn.microsoft.com/en-us/azure/sentinel/soc-optimization/soc-optimization-access",
      "category": "General Security"
    },
    {
      "title": "Access the SOC optimization page",
      "description": "Use one of the following tabs, depending on whether you're working in the Azure portal or Defender portal. When your workspace is onboarded to the Defender portal, SOC optimizations include coverage from across Microsoft security services.",
      "url": "https://learn.microsoft.com/en-us/azure/sentinel/soc-optimization/soc-optimization-access",
      "category": "General Security"
    },
    {
      "title": "Access the SOC optimization page",
      "description": "In Microsoft Sentinel in the Azure portal, under Threat management, select SOC optimization.",
      "url": "https://learn.microsoft.com/en-us/azure/sentinel/soc-optimization/soc-optimization-access",
      "category": "General Security"
    },
    {
      "title": "Understand SOC optimization overview metrics",
      "description": "Select See all threat scenarios to view the full list of relevant threat and risk-based scenarios, percentages of active and recommended analytics rules, and coverage levels.",
      "url": "https://learn.microsoft.com/en-us/azure/sentinel/soc-optimization/soc-optimization-access",
      "category": "General Security"
    },
    {
      "title": "View optimization details and take action",
      "description": "For threat-based coverage optimizations:",
      "url": "https://learn.microsoft.com/en-us/azure/sentinel/soc-optimization/soc-optimization-access",
      "category": "General Security"
    },
    {
      "title": "View optimization details and take action",
      "description": "For threat-based coverage optimizations, select View full threat scenario to see the full list of relevant threats, active and recommended detections, and coverage levels. From there you can jump directly to the Content hub to activate any recommended detections, or to the MITRE ATT&CK page to view the full MITRE ATT&CK coverage for the selected scenario. For example:",
      "url": "https://learn.microsoft.com/en-us/azure/sentinel/soc-optimization/soc-optimization-access",
      "category": "General Security"
    },
    {
      "title": "SOC optimization usage flow",
      "description": "Add analytics rules to use the table for enhanced protection. To use this option, select Go to the Content Hub to view and configure specific out-of-the-box analytic rule templates that use the selected table. In the Content hub, you don't need to search for the relevant rule, as you're taken directly to the relevant rule.",
      "url": "https://learn.microsoft.com/en-us/azure/sentinel/soc-optimization/soc-optimization-access",
      "category": "General Security"
    },
    {
      "title": "SOC optimization usage flow",
      "description": "If new analytic rules require extra log sources, consider ingesting them to improve threat coverage.",
      "url": "https://learn.microsoft.com/en-us/azure/sentinel/soc-optimization/soc-optimization-access",
      "category": "Monitoring"
    },
    {
      "title": "SOC optimization usage flow",
      "description": "For more information, see Discover and manage Microsoft Sentinel out-of-the-box content and Detect threats out-of-the-box.",
      "url": "https://learn.microsoft.com/en-us/azure/sentinel/soc-optimization/soc-optimization-access",
      "category": "General Security"
    },
    {
      "title": "SOC optimization usage flow",
      "description": "Use the optimization recommendations to improve coverage against specific threats. For example, for a human-operated ransomware optimization:",
      "url": "https://learn.microsoft.com/en-us/azure/sentinel/soc-optimization/soc-optimization-access",
      "category": "General Security"
    },
    {
      "title": "SOC optimization usage flow",
      "description": "Select Go to Content hub to view all recommended security content, filtered specifically for this optimization.",
      "url": "https://learn.microsoft.com/en-us/azure/sentinel/soc-optimization/soc-optimization-access",
      "category": "General Security"
    },
    {
      "title": "",
      "description": "Upgrade to Microsoft Edge to take advantage of the latest features, security updates, and technical support.",
      "url": "https://learn.microsoft.com/en-us/azure/networking/security/",
      "category": "General Security"
    },
    {
      "title": "Azure network security documentation",
      "description": "Learn about the various Azure network security services available that provide security for your resources in Azure.",
      "url": "https://learn.microsoft.com/en-us/azure/networking/security/",
      "category": "Network Security"
    },
    {
      "title": "Get started",
      "description": "A cloud-native web application firewall (WAF) service that provides powerful protection for web apps",
      "url": "https://learn.microsoft.com/en-us/azure/networking/security/",
      "category": "Network Security"
    },
    {
      "title": "Get started",
      "description": "Protect your applications from Distributed Denial of Service (DDoS) attacks.",
      "url": "https://learn.microsoft.com/en-us/azure/networking/security/",
      "category": "Network Security"
    },
    {
      "title": "Use cases and scenarios",
      "description": "Explore common use cases and scenarios for Azure network security services.",
      "url": "https://learn.microsoft.com/en-us/azure/networking/security/",
      "category": "Network Security"
    },
    {
      "title": "Learn more",
      "description": "Learn more about network security services.",
      "url": "https://learn.microsoft.com/en-us/azure/networking/security/",
      "category": "Network Security"
    },
    {
      "title": "",
      "description": "Upgrade to Microsoft Edge to take advantage of the latest features, security updates, and technical support.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "General Security"
    },
    {
      "title": "Overview",
      "description": "We know that security is job one in the cloud and how important it is that you find accurate and timely information about Azure security. One of the best reasons to use Azure for your applications and services is to take advantage of its wide array of security tools and capabilities. These tools and capabilities help make it possible to create secure solutions on the secure Azure platform. Microsoft Azure provides confidentiality, integrity, and availability of customer data, while also enabling transparent accountability.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "General Security"
    },
    {
      "title": "Overview",
      "description": "This article provides a comprehensive look at the security available with Azure.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "General Security"
    },
    {
      "title": "Azure platform",
      "description": "Azure public cloud services support the same technologies millions of developers and IT professionals already rely on and trust. When you build on or migrate IT assets to a public cloud service provider, you rely on that organizationâ\u0080\u0099s ability to protect your applications and data. They provide services and controls to manage the security of your cloud-based assets.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "Monitoring"
    },
    {
      "title": "Azure platform",
      "description": "Azure's infrastructure is meticulously crafted from the ground up, encompassing everything from physical facilities to applications, to securely host millions of customers simultaneously. This robust foundation empowers businesses to confidently meet their security requirements.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "General Security"
    },
    {
      "title": "Azure platform",
      "description": "In addition, Azure provides you with a wide array of configurable security options and the ability to control them so that you can customize security to meet the unique requirements of your organizationâ\u0080\u0099s deployments. This document helps you understand how Azure security capabilities can help you fulfill these requirements.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "General Security"
    },
    {
      "title": "Azure platform",
      "description": "The primary focus of this document is on customer-facing controls that you can use to customize and increase security for your applications and services.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "General Security"
    },
    {
      "title": "Azure platform",
      "description": "For information on how Microsoft secures the Azure platform itself, see Azure infrastructure security.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "General Security"
    },
    {
      "title": "Summary of Azure security capabilities",
      "description": "Depending on the cloud service model, there's variable responsibility for who is responsible for managing the security of the application or service. There are capabilities available in the Azure Platform to assist you in meeting these responsibilities through built-in features, and through partner solutions that can be deployed into an Azure subscription.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "General Security"
    },
    {
      "title": "Operations",
      "description": "This section provides additional information regarding key features in security operations and summary information about these capabilities.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "General Security"
    },
    {
      "title": "Microsoft Sentinel",
      "description": "Microsoft Sentinel is a scalable, cloud-native, security information, and event management (SIEM) and security orchestration, automation, and response (SOAR) solution. Microsoft Sentinel delivers intelligent security analytics and threat intelligence across the enterprise. Microsoft Sentinel provides a single solution for attack detection, threat visibility, proactive hunting, and threat response.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "General Security"
    },
    {
      "title": "Microsoft Defender for Cloud",
      "description": "Microsoft Defender for Cloud helps you prevent, detect, and respond to threats with increased visibility into and control over the security of your Azure resources. Microsoft Defender for Cloud provides integrated security monitoring and policy management across your Azure subscriptions. Microsoft Defender for Cloud helps detect threats that might otherwise go unnoticed, and works with a broad ecosystem of security solutions.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "Monitoring"
    },
    {
      "title": "Microsoft Defender for Cloud",
      "description": "In addition, Defender for Cloud helps with security operations by providing you with a single dashboard that surfaces alerts and recommendations that can be acted upon immediately. Often, you can remediate issues with a single selection within the Defender for Cloud console.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "Monitoring"
    },
    {
      "title": "Azure Resource Manager",
      "description": "Azure Resource Manager enables you to work with the resources in your solution as a group. You can deploy, update, or delete all the resources for your solution in a single, coordinated operation. You use an Azure Resource Manager template for deployment and that template can work for different environments such as testing, staging, and production. Resource Manager provides security, auditing, and tagging features to help you manage your resources after deployment.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "Monitoring"
    },
    {
      "title": "Azure Resource Manager",
      "description": "Azure Resource Manager template-based deployments help improve the security of solutions deployed in Azure because standard security control settings and can be integrated into standardized template-based deployments. Templates reduce the risk of security configuration errors that might take place during manual deployments.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "Compliance"
    },
    {
      "title": "Application Insights",
      "description": "If there are crashes, failures, or performance issues, you can search through the data in detail to diagnose the cause. And the service sends you emails if there are any changes in the availability and performance of your app. Application Insight thus becomes a valuable security tool because it helps with the availability in the confidentiality, integrity, and availability security triad.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "General Security"
    },
    {
      "title": "Azure Monitor",
      "description": "Azure Monitor offers visualization, query, routing, alerting, auto scale, and automation on data both from the Azure subscription (Activity Log) and each individual Azure resource (Resource Logs). You can use Azure Monitor to alert you on security-related events that are generated in Azure logs.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "Monitoring"
    },
    {
      "title": "Azure Monitor logs",
      "description": "Azure Monitor logs can be a useful tool in forensic and other security analysis, as the tool enables you to quickly search through large amounts of security-related entries with a flexible query approach. In addition, on-premises firewall and proxy logs can be exported into Azure and made available for analysis using Azure Monitor logs.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "Network Security"
    },
    {
      "title": "Azure Advisor",
      "description": "Azure Advisor is a personalized cloud consultant that helps you to optimize your Azure deployments. It analyzes your resource configuration and usage data. It then recommends solutions to help improve the performance, security, and reliability of your resources while looking for opportunities to reduce your overall Azure spend. Azure Advisor provides security recommendations, which can significantly improve your overall security posture for solutions you deploy in Azure. These recommendations are drawn from security analysis performed by Microsoft Defender for Cloud.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "General Security"
    },
    {
      "title": "Applications",
      "description": "The section provides additional information regarding key features in application security and summary information about these capabilities.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "General Security"
    },
    {
      "title": "Web Application firewall",
      "description": "The Web Application Firewall (WAF) in Azure Application Gateway provides protection for web applications against common web-based attacks such as SQL injection, cross-site scripting, and session hijacking. It is preconfigured to defend against the top 10 vulnerabilities identified by the Open Web Application Security Project (OWASP).",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "Network Security"
    },
    {
      "title": "Authentication and authorization in Azure App Service",
      "description": "App Service Authentication / Authorization is a feature that provides a way for your application to sign in users so that you don't have to change code on the app backend. It provides an easy way to protect your application and work with per-user data.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "Authentication"
    },
    {
      "title": "Layered Security Architecture",
      "description": "Since App Service Environments provide an isolated runtime environment deployed into an Azure Virtual Network, developers can create a layered security architecture providing differing levels of network access for each application tier. It's common to hide API back-ends from general Internet access, and only permit APIs to be called by upstream web apps. Network Security groups (NSGs) can be used on Azure Virtual Network subnets containing App Service Environments to restrict public access to API applications.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "Network Security"
    },
    {
      "title": "Storage",
      "description": "The section provides additional information regarding key features in Azure storage security and summary information about these capabilities.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "General Security"
    },
    {
      "title": "Azure role-based access control (Azure RBAC)",
      "description": "You can secure your storage account with Azure role-based access control (Azure RBAC). Restricting access based on the need to know and least privilege security principles is imperative for organizations that want to enforce Security policies for data access. These access rights are granted by assigning the appropriate Azure role to groups and applications at a certain scope. You can use Azure built-in roles, such as Storage Account Contributor, to assign privileges to users. Access to the storage keys for a storage account using the Azure Resource Manager model can be controlled through Azure RBAC.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "General Security"
    },
    {
      "title": "Encryption in Transit",
      "description": "Encryption in transit is a mechanism of protecting data when it's transmitted across networks. With Azure Storage, you can secure data using:",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "Data Protection"
    },
    {
      "title": "Encryption at rest",
      "description": "For many organizations, data encryption at rest is a mandatory step towards data privacy, compliance, and data sovereignty. There are three Azure storage security features that provide encryption of data that is at rest:",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "Data Protection"
    },
    {
      "title": "Networking",
      "description": "The section provides additional information regarding key features in Azure network security and summary information about these capabilities.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "Network Security"
    },
    {
      "title": "Network Layer Controls",
      "description": "Network access control is the act of limiting connectivity to and from specific devices or subnets and represents the core of network security. The goal of network access control is to make sure that your virtual machines and services are accessible to only users and devices to which you want them accessible.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "Network Security"
    },
    {
      "title": "Network Security Groups",
      "description": "A Network Security Group (NSG) is a basic stateful packet filtering firewall and it enables you to control access based on a five-tuple. NSGs don't provide application layer inspection or authenticated access controls. They can be used to control traffic moving between subnets within an Azure Virtual Network and traffic between an Azure Virtual Network and the Internet.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "Network Security"
    },
    {
      "title": "Azure Firewall",
      "description": "Azure Firewall is a cloud-native and intelligent network firewall security service that provides threat protection for your cloud workloads running in Azure. It's a fully stateful firewall as a service with built-in high availability and unrestricted cloud scalability. It provides both east-west and north-south traffic inspection.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "Network Security"
    },
    {
      "title": "Azure Firewall",
      "description": "Azure Firewall is offered in three SKUs: Basic, Standard and Premium. Azure Firewall Basic offers simplified security similar to the Standard SKU but without advanced features. Azure Firewall Standard provides L3-L7 filtering and threat intelligence feeds directly from Microsoft Cyber Security. Azure Firewall Premium provides advanced capabilities include signature-based IDPS to allow rapid detection of attacks by looking for specific patterns.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "Network Security"
    },
    {
      "title": "Azure DDoS Protection",
      "description": "Azure DDoS Protection, combined with application design best practices, offers enhanced features to defend against DDoS attacks. It is automatically tuned to protect your specific Azure resources in a virtual network. Enabling protection is simple on any new or existing virtual network and requires no changes to your applications or resources.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "Network Security"
    },
    {
      "title": "Azure DDoS Protection",
      "description": "Azure DDoS Protection offers two tiers: DDoS Network Protection and DDoS IP Protection.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "Network Security"
    },
    {
      "title": "Azure DDoS Protection",
      "description": "DDoS Network Protection  provides enhanced features to defend against Distributed Denial of Service (DDoS) attacks. It operates at network layers 3 and 4 and includes advanced features such as DDoS rapid response support, cost protection, and discounts on Web Application Firewall (WAF).",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "Network Security"
    },
    {
      "title": "Azure DDoS Protection",
      "description": "DDoS IP Protection follows a pay-per-protected IP model. It includes the same core engineering features as DDoS Network Protection but does not offer the additional services like DDoS rapid response support, cost protection, and WAF discounts.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "Network Security"
    },
    {
      "title": "Route Control and Forced Tunneling",
      "description": "The ability to control routing behavior on your Azure Virtual Networks is a critical network security and access control capability. For example, if you want to make sure that all traffic to and from your Azure Virtual Network goes through that virtual security appliance, you need to be able to control and customize routing behavior. You can do this by configuring User-Defined Routes in Azure.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "Network Security"
    },
    {
      "title": "Route Control and Forced Tunneling",
      "description": "Forced tunneling is commonly used to force outbound traffic to the Internet to go through on-premises security proxies and firewalls.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "Network Security"
    },
    {
      "title": "Virtual Network Security Appliances",
      "description": "While Network Security Groups, User-Defined Routes, and forced tunneling provide you with a level of security at the network and transport layers of the OSI model, there might be times when you want to enable security at higher levels of the stack. You can access these enhanced network security features by using an Azure partner network security appliance solution. You can find the most current Azure partner network security solutions by visiting the Azure Marketplace and searching for security and network security.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "Network Security"
    },
    {
      "title": "Azure Virtual Network",
      "description": "An Azure virtual network (VNet) is a representation of your own network in the cloud. It's a logical isolation of the Azure network fabric dedicated to your subscription. You can fully control the IP address blocks, DNS settings, security policies, and route tables within this network. You can segment your VNet into subnets and place Azure IaaS virtual machines (VMs) and/or Cloud services (PaaS role instances) on Azure Virtual Networks.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "Network Security"
    },
    {
      "title": "Azure Virtual Network Manager",
      "description": "Azure Virtual Network Manager  provides a centralized solution for protecting your virtual networks at scale. It uses security admin rules to centrally define and enforce security policies for your virtual networks across your entire organization. Security admin rules take precedence over network security group(NSGs) rules and are applied on the virtual network. This allows organizations to enforce core policies with security admin rules, while still enabling downstream teams to tailor NSGs according to their specific needs at the subnet and NIC levels. Depending on the needs of your organization you can use Allow, Deny, or Always Allow rule actions to enforce security policies.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "Network Security"
    },
    {
      "title": "Azure Virtual Network Manager",
      "description": "In Azure Virtual Network Manager, network groups allow you to group virtual networks together for centralized management and enforcement of security policies. Network groups are a logical grouping of virtual networks based on your needs from a topology and security perspective. You can manually update the virtual network membership of your network groups or you can define conditional statements with Azure Policy to dynamically update network groups to automatically update your network group membership.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "Network Security"
    },
    {
      "title": "Express Route",
      "description": "ExpressRoute connections don't go over the public Internet and thus can be considered more secure than VPN-based solutions. This allows ExpressRoute connections to offer more reliability, faster speeds, lower latencies, and higher security than typical connections over the Internet.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "General Security"
    },
    {
      "title": "Web Application Firewall",
      "description": "Web Application Firewall is a feature of Azure Application Gateway that provides protection to web applications that use application gateway for standard Application Delivery Control (ADC) functions. Web application firewall does this by protecting them against most of the OWASP top 10 common web vulnerabilities.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "Network Security"
    },
    {
      "title": "Web Application Firewall",
      "description": "Protection against common web attacks such as command injection, HTTP request smuggling, HTTP response splitting, and remote file inclusion",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "General Security"
    },
    {
      "title": "Web Application Firewall",
      "description": "Protection against HTTP protocol violations",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "General Security"
    },
    {
      "title": "Web Application Firewall",
      "description": "Protection against HTTP protocol anomalies, such as missing host, user-agent, and accept headers",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "General Security"
    },
    {
      "title": "Web Application Firewall",
      "description": "A centralized web application firewall (WAF) simplifies security management and enhances protection against web attacks. It provides better assurance against intrusion threats and can respond faster to security threats by patching known vulnerabilities centrally, rather than securing each individual web application. Existing application gateways can be easily upgraded to include a web application firewall.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "Network Security"
    },
    {
      "title": "Internal DNS",
      "description": "You can manage the list of DNS servers used in a VNet in the Management Portal, or in the network configuration file. Customer can add up to 12 DNS servers for each VNet. When specifying DNS servers, it's important to verify that you list customerâ\u0080\u0099s DNS servers in the correct order for customerâ\u0080\u0099s environment. DNS server lists don't work round-robin. They're used in the order that they're specified. If the first DNS server on the list is able to be reached, the client uses that DNS server regardless of whether the DNS server is functioning properly or not. To change the DNS server order for customerâ\u0080\u0099s virtual network, remove the DNS servers from the list and add them back in the order that customer wants. DNS supports the availability aspect of the â\u0080\u009cCIAâ\u0080\u009d security triad.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "Network Security"
    },
    {
      "title": "Azure DNS",
      "description": "The Domain Name System, or DNS, is responsible for translating (or resolving) a website or service name to its IP address. Azure DNS is a hosting service for DNS domains, providing name resolution using Microsoft Azure infrastructure. By hosting your domains in Azure, you can manage your DNS records using the same credentials, APIs, tools, and billing as your other Azure services. DNS supports the availability aspect of the â\u0080\u009cCIAâ\u0080\u009d security triad.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "General Security"
    },
    {
      "title": "Microsoft Defender for Cloud",
      "description": "Microsoft Defender for Cloud continuously analyzes the security state of your Azure resources for network security best practices. When Defender for Cloud identifies potential security vulnerabilities, it creates recommendations that guide you through the process of configuring the needed controls to harden and protect your resources.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "Network Security"
    },
    {
      "title": "Advanced Container Networking Services (ACNS)",
      "description": "Advanced Container Networking Services (ACNS) is a comprehensive suite designed to elevate the operational efficiency of your Azure Kubernetes Service (AKS) clusters. It provides advanced security and observability features, addressing the complexities of managing microservices infrastructure at scale.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "Network Security"
    },
    {
      "title": "Advanced Container Networking Services (ACNS)",
      "description": "Security: For clusters using Azure CNI Powered by Cilium, network policies include fully qualified domain name (FQDN) filtering for solving the complexities of maintaining configuration.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "Network Security"
    },
    {
      "title": "Azure confidential computing",
      "description": "Azure confidential computing provides the final, missing piece, of the data protection puzzle. It allows you to keep your data encrypted always. While at rest, when in motion through the network, and now, even while loaded in memory and in use. Additionally, by making Remote Attestation possible, it allows you to cryptographically verify that the VM you deploy booted securely and is configured correctly, before unlocking your data.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "Data Protection"
    },
    {
      "title": "Azure confidential computing",
      "description": "The spectrum of option ranges from enabling \"lift and shift\" scenarios of existing applications, to a full control of security features. For Infrastructure as a Service (IaaS), you can use confidential virtual machines powered by AMD SEV-SNP or confidential application enclaves for virtual machines that run Intel Software Guard Extensions (SGX). For Platform as a Service, we have multiple container based options, including integrations with Azure Kubernetes Service (AKS).",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "General Security"
    },
    {
      "title": "Antimalware & Antivirus",
      "description": "With Azure IaaS, you can use antimalware software from security vendors such as Microsoft, Symantec, Trend Micro, McAfee, and Kaspersky to protect your virtual machines from malicious files, adware, and other threats. Microsoft Antimalware for Azure Cloud Services and Virtual Machines is a protection capability that helps identify and remove viruses, spyware, and other malicious software. Microsoft Antimalware provides configurable alerts when known malicious or unwanted software attempts to install itself or run on your Azure systems. Microsoft Antimalware can also be deployed using Microsoft Defender for Cloud",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "Monitoring"
    },
    {
      "title": "Hardware Security Module",
      "description": "Encryption and authentication don't improve security unless the keys themselves are protected. You can simplify the management and security of your critical secrets and keys by storing them in Azure Key Vault. Key Vault provides the option to store your keys in hardware Security modules (HSMs) certified to FIPS 140 validated standards. Your SQL Server encryption keys for backup or transparent data encryption can all be stored in Key Vault with any keys or secrets from your applications. Permissions and access to these protected items are managed through Microsoft Entra ID.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "Authentication"
    },
    {
      "title": "Virtual machine backup",
      "description": "Azure Backup is a solution that protects your application data with zero capital investment and minimal operating costs. Application errors can corrupt your data, and human errors can introduce bugs into your applications that can lead to security issues. With Azure Backup, your virtual machines running Windows and Linux are protected.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "General Security"
    },
    {
      "title": "SQL VM TDE",
      "description": "The Azure Key Vault (AKV) service is designed to improve the security and management of these keys in a secure and highly available location. The SQL Server Connector enables SQL Server to use these keys from Azure Key Vault.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "General Security"
    },
    {
      "title": "Security policy management and reporting",
      "description": "Defender for Cloud helps you prevent, detect, and respond to threats, and provides you increased visibility into, and control over, the security of your Azure resources. It provides integrated Security monitoring and policy management across your Azure subscriptions, helps detect threats that might otherwise go unnoticed, and works with a broad ecosystem of security solutions.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "Monitoring"
    },
    {
      "title": "Identity and access management",
      "description": "Securing systems, applications, and data begins with identity-based access controls. The identity and access management features that are built into Microsoft business products and services help protect your organizational and personal information from unauthorized access while making it available to legitimate users whenever and wherever they need it.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "Authentication"
    },
    {
      "title": "Secure Identity",
      "description": "Microsoft uses multiple security practices and technologies across its products and services to manage identity and access.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "Authentication"
    },
    {
      "title": "Secure Identity",
      "description": "Password policy enforcement increases the security of traditional passwords by imposing length and complexity requirements, forced periodic rotation, and account lockout after failed authentication attempts.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "Authentication"
    },
    {
      "title": "Secure Identity",
      "description": "Azure role-based access control (Azure RBAC) enables you to grant access based on the userâ\u0080\u0099s assigned role, making it easy to give users only the amount of access they need to perform their job duties. You can customize Azure RBAC per your organizationâ\u0080\u0099s business model and risk tolerance.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "General Security"
    },
    {
      "title": "Secure Apps and data",
      "description": "Microsoft Entra ID, a comprehensive identity, and access management cloud solution, helps secure access to data in applications on site and in the cloud, and simplifies the management of users and groups. It combines core directory services, advanced identity governance, security, and application access management, and makes it easy for developers to build policy-based identity management into their apps. To enhance your Microsoft Entra ID, you can add paid capabilities using the Microsoft Entra Basic, Premium P1, and Premium P2 editions.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "Authentication"
    },
    {
      "title": "Secure Apps and data",
      "description": "Microsoft Entra ID Protection is a security service that uses Microsoft Entra anomaly detection capabilities to provide a consolidated view into risk detections and potential vulnerabilities that could affect your organizationâ\u0080\u0099s identities.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "General Security"
    },
    {
      "title": "Next Steps",
      "description": "Learn how Microsoft Defender for Cloud can help you prevent, detect, and respond to threats with increased visibility and control over the security of your Azure resources.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/overview",
      "category": "General Security"
    },
    {
      "title": "",
      "description": "Upgrade to Microsoft Edge to take advantage of the latest features, security updates, and technical support.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/shared-responsibility",
      "category": "General Security"
    },
    {
      "title": "In this article",
      "description": "As you consider and evaluate public cloud services, it's critical to understand the shared responsibility model and which security tasks the cloud provider handles and which tasks you handle. The workload responsibilities vary depending on whether the workload is hosted on Software as a Service (SaaS), Platform as a Service (PaaS), Infrastructure as a Service (IaaS), or in an on-premises datacenter.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/shared-responsibility",
      "category": "General Security"
    },
    {
      "title": "Division of responsibility",
      "description": "For all cloud deployment types, you own your data and identities. You're responsible for protecting the security of your data and identities, on-premises resources, and the cloud components you control. Cloud components you control vary by service type.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/shared-responsibility",
      "category": "General Security"
    },
    {
      "title": "Cloud security advantages",
      "description": "The cloud offers significant advantages for solving long standing information security challenges. In an on-premises environment, organizations likely have unmet responsibilities and limited resources available to invest in security, which creates an environment where attackers are able to exploit vulnerabilities at all layers.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/shared-responsibility",
      "category": "General Security"
    },
    {
      "title": "Cloud security advantages",
      "description": "The following diagram shows a traditional approach where many security responsibilities are unmet due to limited resources. In the cloud-enabled approach, you're able to shift day to day security responsibilities to your cloud provider and reallocate your resources.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/shared-responsibility",
      "category": "General Security"
    },
    {
      "title": "Cloud security advantages",
      "description": "In the cloud-enabled approach, you're also able to apply cloud-based security capabilities for more effectiveness and use cloud intelligence to improve your threat detection and response time. By shifting responsibilities to the cloud provider, organizations can get more security coverage, which enables them to reallocate security resources and budget to other business priorities.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/shared-responsibility",
      "category": "General Security"
    },
    {
      "title": "Next step",
      "description": "Learn more about shared responsibility and strategies to improve your security posture in the Well-Architected Framework's overview of the security pillar.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/shared-responsibility",
      "category": "General Security"
    },
    {
      "title": "",
      "description": "Upgrade to Microsoft Edge to take advantage of the latest features, security updates, and technical support.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/ransomware-protection",
      "category": "General Security"
    },
    {
      "title": "In this article",
      "description": "Ransomware and extortion are a high profit, low-cost business, which has a debilitating impact on targeted organizations, national/regional security, economic security, and public health and safety. What started as simple, single-PC ransomware grew to include various extortion techniques directed at all types of corporate networks and cloud platforms.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/ransomware-protection",
      "category": "Network Security"
    },
    {
      "title": "In this article",
      "description": "To ensure customers running on Azure are protected against ransomware attacks, Microsoft invests heavily on the security of our cloud platforms, and provides security controls you need to protect your Azure cloud workloads",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/ransomware-protection",
      "category": "General Security"
    },
    {
      "title": "In this article",
      "description": "By using Azure native ransomware protections and implementing the best practices recommended in this article, you're taking measures that positions your organization to prevent, protect, and detect potential ransomware attacks on your Azure assets.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/ransomware-protection",
      "category": "General Security"
    },
    {
      "title": "In this article",
      "description": "This article lays out key Azure native capabilities and defenses for ransomware attacks and guidance on how to proactively use these to protect your assets on Azure cloud.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/ransomware-protection",
      "category": "General Security"
    },
    {
      "title": "A growing threat",
      "description": "Ransomware attacks are one of the biggest security challenges facing businesses today. When successful, ransomware attacks can disable a business core IT infrastructure, and cause destruction that could have a debilitating impact on the physical, economic security or safety of a business. Ransomware attacks are targeted to businesses of all types. This requires that all businesses take preventive measures to ensure protection.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/ransomware-protection",
      "category": "General Security"
    },
    {
      "title": "A growing threat",
      "description": "Recent trends on the number of attacks are alarming. While 2020 wasn't a good year for ransomware attacks on businesses, 2021 started on a bad trajectory.  On May 7, the Colonial pipeline (Colonial) attack shut down services such as pipeline transportation of diesel, gasoline, and jet fuel were temporary halted. Colonial shut the critical fuel network supplying the populous eastern states.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/ransomware-protection",
      "category": "Network Security"
    },
    {
      "title": "A growing threat",
      "description": "Historically, cyberattacks were seen as a sophisticated set of actions targeting particular industries, which left the remaining industries believing they were outside the scope of cybercrime, and without context about which cybersecurity threats they should prepare for. Ransomware represents a major shift in this threat landscape, and it's made cyberattacks a real and omnipresent danger for everyone. Encrypted and lost files and threatening ransom notes have now become the top-of-mind fear for most executive teams.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/ransomware-protection",
      "category": "General Security"
    },
    {
      "title": "A growing threat",
      "description": "Ransomware's economic model capitalizes on the misperception that a ransomware attack is solely a malware incident. Whereas in reality ransomware is a breach involving human adversaries attacking a network.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/ransomware-protection",
      "category": "Network Security"
    },
    {
      "title": "A growing threat",
      "description": "For many organizations, the cost to rebuild from scratch after a ransomware incident far outweighs the original ransom demanded. With a limited understanding of the threat landscape and how ransomware operates, paying the ransom seems like the better business decision to return to operations. However, the real damage is often done when the cybercriminal exfiltrates files for release or sale, while leaving backdoors in the network for future criminal activityâ\u0080\u0094and these risks persist whether or not the ransom is paid.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/ransomware-protection",
      "category": "Network Security"
    },
    {
      "title": "What is ransomware",
      "description": "Ransomware will typically exploit the weaknesses or vulnerabilities in your organization's IT systems or infrastructures to succeed. The attacks are so obvious that it doesn't take much investigation to confirm that your business has been attacked or that an incident should be declared.  The exception would be a spam email that demands ransom in exchange for supposedly compromising materials.  In this case, these types of incidents should be dealt with as spam unless the email contains highly specific information.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/ransomware-protection",
      "category": "General Security"
    },
    {
      "title": "What is ransomware",
      "description": "Any business or organization that operates an IT system with data in it can be attacked.   Although individuals can be targeted in a ransomware attack,  most attacks are targeted at businesses. While the Colonial ransomware attack of May 2021 drew considerable public attention, our Detection and Response team (DART)'s ransomware engagement data shows that the energy sector represents one of the most targeted sectors, along with the financial, healthcare, and entertainment sectors.  And despite continued promises not to attack hospitals or healthcare companies during a pandemic, healthcare remains the number one target of human operated ransomware.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/ransomware-protection",
      "category": "General Security"
    },
    {
      "title": "How your assets are targeted",
      "description": "When attacking cloud infrastructure, adversaries often attack multiple resources to try to obtain access to customer data or company secrets. The cloud \"kill chain\" model explains how attackers attempt to gain access to any of your resources running in the public cloud through a four-step process: exposure, access, lateral movement, and actions.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/ransomware-protection",
      "category": "General Security"
    },
    {
      "title": "Why attacks succeed",
      "description": "There are several reasons why ransomware attacks succeed. Businesses that are vulnerable often fall victim to ransomware attacks. The following are some of the attack's critical success factors:",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/ransomware-protection",
      "category": "General Security"
    },
    {
      "title": "Why attacks succeed",
      "description": "Attackers use different techniques, such as Remote Desktop Protocol (RDP) brute force attack to exploit vulnerabilities.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/ransomware-protection",
      "category": "General Security"
    },
    {
      "title": "Should you pay?",
      "description": "There are varying opinions on what the best option is when confronted with this vexing demand.  The Federal Bureau of Investigation (FBI) advises victims not to pay ransom but to instead be vigilant and take proactive measures to secure their data before an attack.  They contend that paying doesn't guarantee that locked systems and encrypted data are released again. The FBI says another reason not to pay is that payments to cyber criminals incentivize them to continue to attack organizations",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/ransomware-protection",
      "category": "General Security"
    },
    {
      "title": "Should you pay?",
      "description": "Nevertheless, some victims elect to pay the ransom demand even though system and data access isn't guaranteed after paying the ransom. By paying, such organizations take the calculated risk to pay in hopes of getting back their system and data and quickly resuming normal operations.  Part of the calculation is reduction in collateral costs such as lost productivity, decreased revenue over time, exposure of sensitive data, and potential reputational damage.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/ransomware-protection",
      "category": "Data Protection"
    },
    {
      "title": "Should you pay?",
      "description": "The best way to prevent paying ransom isn't to fall victim by implementing preventive measures and having tool saturation to protect your organization from every step that attacker takes wholly or incrementally to hack into your system. In addition, having the ability to recover impacted assets ensure restoration of business operations in a timely fashion. Azure Cloud has a robust set of tools to guide you all the way.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/ransomware-protection",
      "category": "General Security"
    },
    {
      "title": "What is the typical cost to a business?",
      "description": "The impact of a ransomware attack on any organization is difficult to quantify accurately. However, depending on the scope and type, the impact is multi-dimensional and is broadly expressed in:",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/ransomware-protection",
      "category": "General Security"
    },
    {
      "title": "Next steps",
      "description": "See the white paper: Azure defenses for ransomware attack whitepaper.",
      "url": "https://learn.microsoft.com/en-us/azure/security/fundamentals/ransomware-protection",
      "category": "General Security"
    },
    {
      "title": "",
      "description": "Upgrade to Microsoft Edge to take advantage of the latest features, security updates, and technical support.",
      "url": "https://learn.microsoft.com/en-us/azure/governance/policy/overview",
      "category": "General Security"
    },
    {
      "title": "In this article",
      "description": "Common use cases for Azure Policy include implementing governance for resource consistency, regulatory compliance, security, cost, and management. Policy definitions for these common use cases are already available in your Azure environment as built-ins to help you get started.",
      "url": "https://learn.microsoft.com/en-us/azure/governance/policy/overview",
      "category": "Compliance"
    },
    {
      "title": "Special permissions requirement for Azure Policy with Azure Virtual Network Manager",
      "description": "Azure Virtual Network Manager (preview) enables you to apply consistent management and security policies to multiple Azure virtual networks throughout your cloud infrastructure. Azure Virtual Network Manager (AVNM) dynamic groups use Azure Policy definitions to evaluate virtual network membership in those groups.",
      "url": "https://learn.microsoft.com/en-us/azure/governance/policy/overview",
      "category": "Network Security"
    },
    {
      "title": "Initiative definition",
      "description": "An initiative definition is a collection of policy definitions that are tailored toward achieving a singular overarching goal. Initiative definitions simplify managing and assigning policy definitions. They simplify by grouping a set of policies as one single item. For example, you could create an initiative titled Enable Monitoring in Microsoft Defender for Cloud, with a goal to monitor all the available security recommendations in your Microsoft Defender for Cloud instance.",
      "url": "https://learn.microsoft.com/en-us/azure/governance/policy/overview",
      "category": "Monitoring"
    },
    {
      "title": "",
      "description": "Upgrade to Microsoft Edge to take advantage of the latest features, security updates, and technical support.",
      "url": "https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/strategy/define-security-strategy",
      "category": "General Security"
    },
    {
      "title": "In this article",
      "description": "You need a well-designed security strategy for a successful cloud adoption. If your organization uses traditional on-premises environments, you should evaluate your cloud expertise and specifically focus on cloud security. To manage security in the cloud, you might need to make significant changes to the structure of your security team and your overall security approach.",
      "url": "https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/strategy/define-security-strategy",
      "category": "General Security"
    },
    {
      "title": "Address common challenges",
      "description": "Evolve your mindset. On-premises security is typically a narrowly focused practice that a small team of engineers and operations administrators might handle. Cloud security requires participation from across the organization, and the scope of security teams expands significantly. An on-premises environment's attack surface is primarily at the perimeter. In a cloud environment, every resource is a potential attack vector, so security teams need to adapt their approach accordingly.",
      "url": "https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/strategy/define-security-strategy",
      "category": "General Security"
    },
    {
      "title": "Address common challenges",
      "description": "Adjust teams and roles. Cloud security, especially for large organizations, involves specialized roles. To ensure that you don't have gaps in your security management, you might need to add new teams or reorganize existing teams.",
      "url": "https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/strategy/define-security-strategy",
      "category": "General Security"
    },
    {
      "title": "Address common challenges",
      "description": "Introduce security conversations early. Start security conversations with the right stakeholders early in your cloud adoption process. This approach helps ensure that you can prepare for organizational alignment early on.",
      "url": "https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/strategy/define-security-strategy",
      "category": "General Security"
    },
    {
      "title": "Address common challenges",
      "description": "Understand modern security teams, roles, and functions. Review the Cloud Adoption Framework guidance about security teams, roles, and functions. This guidance describes how to implement end-to-end security.",
      "url": "https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/strategy/define-security-strategy",
      "category": "General Security"
    },
    {
      "title": "Address common challenges",
      "description": "Embrace the Cloud Adoption Framework Secure methodology. Use the Cloud Adoption Framework Secure methodology to apply Microsoft security best practices at each stage of your cloud adoption journey. The guidance for each phase includes several security approaches, including security posture modernization, incident preparation and response, security sustainment, and the Confidentiality, Integrity, and Availability (CIA) Triad.",
      "url": "https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/strategy/define-security-strategy",
      "category": "Monitoring"
    },
    {
      "title": "Understand the Microsoft Secure Future Initiative",
      "description": "As a worldwide cloud provider, Microsoft prioritizes security above all other concerns and recognizes the critical need to prevent security breaches. The Microsoft Secure Future Initiative addresses these concerns and provides an overall approach to build and maintain Microsoft products.",
      "url": "https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/strategy/define-security-strategy",
      "category": "General Security"
    },
    {
      "title": "Understand the Microsoft Secure Future Initiative",
      "description": "The extent to which you prioritize security over other concerns, like reliability, performance, and costs, depends on many factors. You define these factors when you create your overall adoption strategy. Regardless of your priorities, you should understand the pillars of the Microsoft Secure Future Initiative to help focus on key areas of your cloud estate's security that you want to strengthen.",
      "url": "https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/strategy/define-security-strategy",
      "category": "General Security"
    },
    {
      "title": "Adopt a Zero Trust strategy",
      "description": "The Zero Trust principles create the foundation of the Microsoft security strategy. Zero Trust is a cloud-ready security strategy that consists of three main principles:",
      "url": "https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/strategy/define-security-strategy",
      "category": "General Security"
    },
    {
      "title": "Adopt a Zero Trust strategy",
      "description": "Use least privilege: Limit user access with just-in-time and just-enough access, risk-based adaptive policies, and data protection.",
      "url": "https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/strategy/define-security-strategy",
      "category": "Data Protection"
    },
    {
      "title": "Adopt a Zero Trust strategy",
      "description": "Assume breach: Minimize the blast radius and segment access. Verify end-to-end encryption, and use analytics to get visibility, drive threat detection, and improve defenses.",
      "url": "https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/strategy/define-security-strategy",
      "category": "Data Protection"
    },
    {
      "title": "Adopt a Zero Trust strategy",
      "description": "The Zero Trust principles guide your decisions when you design, implement, and operate a cloud estate. They provide a clear reference point to check against, which helps ensure that your choices don't compromise security.",
      "url": "https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/strategy/define-security-strategy",
      "category": "General Security"
    },
    {
      "title": "Adopt a Zero Trust strategy",
      "description": "Use the Microsoft Zero Trust guidance to streamline the integration of a Zero Trust approach into your security strategy. The Zero Trust guidance:",
      "url": "https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/strategy/define-security-strategy",
      "category": "General Security"
    },
    {
      "title": "Use the CISO and MCRA workshops",
      "description": "Microsoft offers workshops to help decision makers and architects apply best practices to their cloud adoption. The Chief Information Security Officer (CISO) workshop focuses on a thorough approach to modernize cybersecurity practices from the perspective of the CISO and other senior leadership roles.",
      "url": "https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/strategy/define-security-strategy",
      "category": "General Security"
    },
    {
      "title": "Use the CISO and MCRA workshops",
      "description": "The Microsoft Cybersecurity Reference Architecture (MCRA) workshop focuses on how to apply architectural best practices to your cloud environment designs. The Zero Trust principles create the foundation for the guidance in the CISO and MCRA workshops. The workshops also align to Microsoft best practices across the Cloud Adoption Framework, Azure Well-Architected Framework, and Zero Trust security recommendations.",
      "url": "https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/strategy/define-security-strategy",
      "category": "General Security"
    },
    {
      "title": "",
      "description": "Upgrade to Microsoft Edge to take advantage of the latest features, security updates, and technical support.",
      "url": "https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/secure/",
      "category": "General Security"
    },
    {
      "title": "In this article",
      "description": "The guidance in this series of articles provides recommendations relevant to all methodologies within the Cloud Adoption Framework because security should be an integral part of every phase of your cloud adoption journey. Therefore, you can find articles aligned with each methodology that provide security recommendations for you to consider as you progress through each phase of your cloud adoption journey.",
      "url": "https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/secure/",
      "category": "Monitoring"
    },
    {
      "title": "In this article",
      "description": "All of the recommendations in this guidance adhere to the Zero Trust principles of assume compromise (or assume breach), least privilege, and explicit verification of trust that should guide your security strategy, architecture, and implementation.",
      "url": "https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/secure/",
      "category": "General Security"
    },
    {
      "title": "Holistic security guidance",
      "description": "Security is a complex and challenging discipline that you need to consider in nearly all aspects of your cloud and technology environments. Consider the following key points:",
      "url": "https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/secure/",
      "category": "Monitoring"
    },
    {
      "title": "Holistic security guidance",
      "description": "Anything is a potential target or attack vector: In today's world, attackers can exploit any weaknesses in an organization's people, processes, and technologies to accomplish their malicious goals.",
      "url": "https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/secure/",
      "category": "Monitoring"
    },
    {
      "title": "Holistic security guidance",
      "description": "Security is a team sport: To defend against these attacks, a coordinated approach is required across business, technology, and security teams. Each team must contribute to security efforts and collaborate effectively. For information about the various roles required to secure Azure resources, see Teams and roles.",
      "url": "https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/secure/",
      "category": "Monitoring"
    },
    {
      "title": "Holistic security guidance",
      "description": "This Cloud Adoption Framework Secure guidance is one component of a larger holistic set of Microsoft security guidance designed to help various teams understand and perform their security responsibilities. The complete set includes the following guidance:",
      "url": "https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/secure/",
      "category": "General Security"
    },
    {
      "title": "Holistic security guidance",
      "description": "The Cloud Adoption Framework Secure methodology provides security guidance for teams that manage the technology infrastructure that supports all the workload development and operations hosted on Azure.",
      "url": "https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/secure/",
      "category": "Monitoring"
    },
    {
      "title": "Holistic security guidance",
      "description": "Azure Well-Architected Framework security guidance provides guidance for individual workload owners about how to apply security best practices to application development and DevOps and DevSecOps processes. Microsoft provides guidance that complements this documentation about how to apply security practices and DevSecOps controls in a security development lifecycle.",
      "url": "https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/secure/",
      "category": "General Security"
    },
    {
      "title": "Holistic security guidance",
      "description": "Microsoft Cloud Security Benchmark provides best practice guidance for stakeholders to ensure robust cloud security. This guidance includes security baselines that describe the available security features and recommended optimal configurations for Azure services.",
      "url": "https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/secure/",
      "category": "General Security"
    },
    {
      "title": "Holistic security guidance",
      "description": "Zero Trust guidance provides guidance for security teams to implement technical capabilities to support a Zero Trust modernization initiative.",
      "url": "https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/secure/",
      "category": "General Security"
    },
    {
      "title": "Security posture modernization",
      "description": "Throughout your cloud adoption journey, look for opportunities to enhance your overall security posture through modernization. The guidance in this methodology is aligned with the Microsoft Zero Trust adoption framework. This framework provides a detailed, step-by-step approach to modernizing your security posture. As you review the recommendations for each phase of the Cloud Adoption Framework methodology, enhance them by using the guidance provided in the Zero Trust adoption framework.",
      "url": "https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/secure/",
      "category": "Monitoring"
    },
    {
      "title": "Incident preparation and response",
      "description": "Incident preparation and response are cornerstone elements of your overall security posture. Your ability to prepare for and respond to incidents can significantly affect your success in operating within the cloud. Well-designed preparation mechanisms and operational practices enable quicker threat detection and help minimize the blast radius of incidents. This approach facilitates faster recovery. Similarly, well-structured response mechanisms and operational practices ensure efficient navigation through recovery activities and provide clear opportunities for continuous improvement throughout the process. By focusing on these elements, you can enhance your overall security strategy, which ensures resilience and operational continuity in the cloud.",
      "url": "https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/secure/",
      "category": "General Security"
    },
    {
      "title": "The CIA Triad",
      "description": "The CIA Triad is a fundamental model in information security that represents three core principles. These principles are confidentiality, integrity, and availability.",
      "url": "https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/secure/",
      "category": "General Security"
    },
    {
      "title": "The CIA Triad",
      "description": "Confidentiality ensures that only authorized individuals can access sensitive information. This policy includes measures like encryption and access controls to protect data from unauthorized access.",
      "url": "https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/secure/",
      "category": "Data Protection"
    },
    {
      "title": "The CIA Triad",
      "description": "Integrity maintains the accuracy and completeness of data. This principle means protecting data from alterations or tampering by unauthorized users, which ensures that the information remains reliable.",
      "url": "https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/secure/",
      "category": "General Security"
    },
    {
      "title": "The CIA Triad",
      "description": "Adopt the CIA Triad to ensure that your business technology remains reliable and secure. Use it to enforce reliability and security in your operations through well-defined, strictly followed, and proven practices. Some ways that the triad principles can help ensure security and reliability are:",
      "url": "https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/secure/",
      "category": "Monitoring"
    },
    {
      "title": "The CIA Triad",
      "description": "Data protection: Protect sensitive data from breaches by taking advantage of the CIA Triad, which ensures privacy and compliance with regulations.",
      "url": "https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/secure/",
      "category": "Data Protection"
    },
    {
      "title": "The CIA Triad",
      "description": "Customer trust: Implement the CIA Triad to build trust with customers and stakeholders by demonstrating a commitment to data security.",
      "url": "https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/secure/",
      "category": "General Security"
    },
    {
      "title": "Security posture sustainment",
      "description": "Continuous improvement is crucial for maintaining a robust security posture in the cloud because cyber threats continuously evolve and become more sophisticated. To protect against these ever-changing risks, ensure ongoing enhancements. The guidance in these sections can help you set up your organization for long-term success by identifying opportunities for continuous improvement. Focus on these strategies as you establish and evolve your cloud environment over time.",
      "url": "https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/secure/",
      "category": "General Security"
    },
    {
      "title": "Cloud security checklist",
      "description": "Use the cloud security checklist to see all tasks for each cloud security step. Quickly navigate to the guidance that you need.",
      "url": "https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/secure/",
      "category": "General Security"
    },
    {
      "title": "Next step",
      "description": "Security teams, roles, and functions",
      "url": "https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/secure/",
      "category": "General Security"
    },
    {
      "title": "",
      "description": "Upgrade to Microsoft Edge to take advantage of the latest features, security updates, and technical support.",
      "url": "https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/plan/",
      "category": "General Security"
    },
    {
      "title": "",
      "description": "Upgrade to Microsoft Edge to take advantage of the latest features, security updates, and technical support.",
      "url": "https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/ready/landing-zone/",
      "category": "General Security"
    },
    {
      "title": "Azure landing zone architecture",
      "description": "Design areas: The conceptual architecture illustrates the relationships between its eight design areas. These design areas are Azure billing and Microsoft Entra tenant, identity and access management, management group and subscription organization, network topology and connectivity, security, management, governance, and platform automation and DevOps. For more information on the design areas, see the Azure Landing Zone environment design areas.",
      "url": "https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/ready/landing-zone/",
      "category": "Authentication"
    },
    {
      "title": "",
      "description": "Upgrade to Microsoft Edge to take advantage of the latest features, security updates, and technical support.",
      "url": "https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/manage/",
      "category": "General Security"
    },
    {
      "title": "In this article",
      "description": "Effective cloud management ensures your Azure cloud estate aligns with business objectives and minimizes the effects of incidents. The Cloud Adoption Framework's (CAF) Manage methodology outlines the RAMP (Ready, Administer, Monitor, Protect) process and provides clear steps for managing your Azure cloud estate.",
      "url": "https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/manage/",
      "category": "Monitoring"
    },
    {
      "title": "",
      "description": "Upgrade to Microsoft Edge to take advantage of the latest features, security updates, and technical support.",
      "url": "https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/innovate/",
      "category": "General Security"
    },
    {
      "title": "",
      "description": "Upgrade to Microsoft Edge to take advantage of the latest features, security updates, and technical support.",
      "url": "https://learn.microsoft.com/en-us/azure/architecture/guide/security/security-start-here",
      "category": "General Security"
    },
    {
      "title": "Security architecture design",
      "description": "Information security has always been a complex subject, and it evolves quickly with the creative ideas and implementations of attackers and security researchers.",
      "url": "https://learn.microsoft.com/en-us/azure/architecture/guide/security/security-start-here",
      "category": "General Security"
    },
    {
      "title": "Security architecture design",
      "description": "Security is one of the most important aspects of any architecture. Good security provides confidentiality, integrity, and availability assurances against deliberate attacks and abuse of your valuable data and systems. Losing these assurances can harm your business operations and revenue, and your organization's reputation.",
      "url": "https://learn.microsoft.com/en-us/azure/architecture/guide/security/security-start-here",
      "category": "General Security"
    },
    {
      "title": "Security architecture design",
      "description": "Learn how cloud security is an ongoing journey of incremental progress and maturity, in Security in the Microsoft Cloud Adoption Framework for Azure. Learn how to build security into your solution, in the Azure Well-Architected Framework Overview of the security pillar.",
      "url": "https://learn.microsoft.com/en-us/azure/architecture/guide/security/security-start-here",
      "category": "General Security"
    },
    {
      "title": "Security architecture design",
      "description": "Here are some broad categories to consider when you design a security system:",
      "url": "https://learn.microsoft.com/en-us/azure/architecture/guide/security/security-start-here",
      "category": "General Security"
    },
    {
      "title": "Security architecture design",
      "description": "Azure provides a wide range of security tools and capabilities. These are just some of the key security services available in Azure:",
      "url": "https://learn.microsoft.com/en-us/azure/architecture/guide/security/security-start-here",
      "category": "General Security"
    },
    {
      "title": "Security architecture design",
      "description": "For a more comprehensive description of Azure security tools and capabilities, see End-to-end security in Azure.",
      "url": "https://learn.microsoft.com/en-us/azure/architecture/guide/security/security-start-here",
      "category": "General Security"
    },
    {
      "title": "Introduction to security on Azure",
      "description": "If you're new to security on Azure, the best way to learn more is with Microsoft Learn training. This free online platform provides interactive training for Microsoft products and more.",
      "url": "https://learn.microsoft.com/en-us/azure/architecture/guide/security/security-start-here",
      "category": "General Security"
    },
    {
      "title": "Introduction to security on Azure",
      "description": "Microsoft Azure Fundamentals: Describe general security and network security features",
      "url": "https://learn.microsoft.com/en-us/azure/architecture/guide/security/security-start-here",
      "category": "Network Security"
    },
    {
      "title": "Introduction to security on Azure",
      "description": "Microsoft Security, Compliance, and Identity Fundamentals: Describe the capabilities of Microsoft security solutions",
      "url": "https://learn.microsoft.com/en-us/azure/architecture/guide/security/security-start-here",
      "category": "Authentication"
    },
    {
      "title": "Best practices",
      "description": "The Azure Well-Architected Framework is a set of guiding tenets, based on five pillars, that you can use to improve the quality of your architectures. For information, see Overview of the security pillar and Security design principles in Azure.",
      "url": "https://learn.microsoft.com/en-us/azure/architecture/guide/security/security-start-here",
      "category": "General Security"
    },
    {
      "title": "Stay current with security",
      "description": "Get the latest updates on Azure security services and features.",
      "url": "https://learn.microsoft.com/en-us/azure/architecture/guide/security/security-start-here",
      "category": "General Security"
    },
    {
      "title": "Example solutions",
      "description": "Browse all our security architectures.",
      "url": "https://learn.microsoft.com/en-us/azure/architecture/guide/security/security-start-here",
      "category": "General Security"
    },
    {
      "title": "Next steps",
      "description": "Security architecture is part of a comprehensive set of security guidance that also includes:",
      "url": "https://learn.microsoft.com/en-us/azure/architecture/guide/security/security-start-here",
      "category": "General Security"
    }
  ]
}